dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEmem_mpu_reg.h
/**
 * \file IfxEmem_mpu_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Emem_mpu_Registers_Cfg Emem_mpu address
 * \ingroup IfxSfr_Emem_mpu_Registers
 * 
 * \defgroup IfxSfr_Emem_mpu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Emem_mpu_Registers_Cfg
 *
 * \defgroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu0 2-EMEMMPU0
 * \ingroup IfxSfr_Emem_mpu_Registers_Cfg
 *
 * \defgroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu1 2-EMEMMPU1
 * \ingroup IfxSfr_Emem_mpu_Registers_Cfg
 *
 *
 */
#ifndef IFXEMEM_MPU_REG_H
#define IFXEMEM_MPU_REG_H 1
/******************************************************************************/
#include "IfxEmem_mpu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Emem_mpu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief EMEM_MPU object */
#define MODULE_EMEMMPU0 /*lint --e(923, 9078)*/ ((*(Ifx_EMEM_MPU*)0xFB000000u))
#define MODULE_EMEMMPU1 /*lint --e(923, 9078)*/ ((*(Ifx_EMEM_MPU*)0xFB010000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu0
 * \{  */
/** \brief 0, EMEM Module Clock Control Register */
#define EMEMMPU0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_CLC*)0xFB000000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMMPU0_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MODID*)0xFB000008u)

/** \brief 10, EMEM Module Access Enable Register 0 */
#define EMEMMPU0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN0*)0xFB000010u)

/** \brief 14, EMEM Module Access Enable Register 1 */
#define EMEMMPU0_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN1*)0xFB000014u)

/** \brief 20, EMEM Module Memory Control Register */
#define EMEMMPU0_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MEMCON*)0xFB000020u)

/** \brief 24, EMEM Module Safety Control Register */
#define EMEMMPU0_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_SCTRL*)0xFB000024u)

/** \brief 50, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN0_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB000050u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN0_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN0_RGNLA.
*/
#define EMEMMPU0_RGNLA0 (EMEMMPU0_RGNWRN0_RGNLA)

/** \brief 54, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN0_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB000054u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN0_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN0_RGNUA.
*/
#define EMEMMPU0_RGNUA0 (EMEMMPU0_RGNWRN0_RGNUA)

/** \brief 58, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN0_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB000058u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN0_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN0_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA0 (EMEMMPU0_RGNWRN0_RGNACCENWA)

/** \brief 5C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN0_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB00005Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN0_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN0_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB0 (EMEMMPU0_RGNWRN0_RGNACCENWB)

/** \brief 60, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN1_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB000060u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN1_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN1_RGNLA.
*/
#define EMEMMPU0_RGNLA1 (EMEMMPU0_RGNWRN1_RGNLA)

/** \brief 64, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN1_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB000064u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN1_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN1_RGNUA.
*/
#define EMEMMPU0_RGNUA1 (EMEMMPU0_RGNWRN1_RGNUA)

/** \brief 68, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN1_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB000068u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN1_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN1_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA1 (EMEMMPU0_RGNWRN1_RGNACCENWA)

