dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEmem_mpu_reg.h
/** \brief C0, EMEM Module Region i Lower Address Register */
#define EMEMMPU1_RGNWRN7_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0100C0u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN7_RGNLA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN7_RGNLA.
*/
#define EMEMMPU1_RGNLA7 (EMEMMPU1_RGNWRN7_RGNLA)

/** \brief C4, EMEM Module Region i Upper Address Register */
#define EMEMMPU1_RGNWRN7_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0100C4u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN7_RGNUA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN7_RGNUA.
*/
#define EMEMMPU1_RGNUA7 (EMEMMPU1_RGNWRN7_RGNUA)

/** \brief C8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU1_RGNWRN7_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0100C8u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN7_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN7_RGNACCENWA.
*/
#define EMEMMPU1_RGNACCENWA7 (EMEMMPU1_RGNWRN7_RGNACCENWA)

/** \brief CC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU1_RGNWRN7_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0100CCu)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN7_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN7_RGNACCENWB.
*/
#define EMEMMPU1_RGNACCENWB7 (EMEMMPU1_RGNWRN7_RGNACCENWB)

/** \brief D8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN0_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0100D8u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN0_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN0_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA0 (EMEMMPU1_RGNACCEN0_RGNACCENRA)

/** \brief DC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN0_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0100DCu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN0_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN0_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB0 (EMEMMPU1_RGNACCEN0_RGNACCENRB)

/** \brief E8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN1_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0100E8u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN1_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN1_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA1 (EMEMMPU1_RGNACCEN1_RGNACCENRA)

/** \brief EC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN1_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0100ECu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN1_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN1_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB1 (EMEMMPU1_RGNACCEN1_RGNACCENRB)

/** \brief F8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN2_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0100F8u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN2_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN2_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA2 (EMEMMPU1_RGNACCEN2_RGNACCENRA)

/** \brief FC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN2_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0100FCu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN2_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN2_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB2 (EMEMMPU1_RGNACCEN2_RGNACCENRB)

/** \brief 108, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN3_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB010108u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN3_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN3_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA3 (EMEMMPU1_RGNACCEN3_RGNACCENRA)

/** \brief 10C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN3_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB01010Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN3_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN3_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB3 (EMEMMPU1_RGNACCEN3_RGNACCENRB)

/** \brief 118, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN4_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB010118u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN4_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN4_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA4 (EMEMMPU1_RGNACCEN4_RGNACCENRA)

/** \brief 11C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN4_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB01011Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN4_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN4_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB4 (EMEMMPU1_RGNACCEN4_RGNACCENRB)

/** \brief 128, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN5_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB010128u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN5_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN5_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA5 (EMEMMPU1_RGNACCEN5_RGNACCENRA)

